ObjectStorage/src/InformationRegisters/ох_ПрисоединенныеФайлыВХранилище/ох_ПрисоединенныеФайлыВХранилище.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ох_ПрисоединенныеФайлыВХранилище</name>
  <resources>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаДействияСсылки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияСсылки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ссылка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>DefinedType.ох_ПрисоединенныеФайлыОбъектногоХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВладелецФайла</name>
    <type>
      <types>DefinedType.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СервисныйАккаунт</name>
    <type>
      <types>CatalogRef.ох_СервисныеАккаунтыОбъектныхХранилищ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Бакет</name>
    <type>
      <types>CatalogRef.ох_БакетыОбъектныхХранилищ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ObjectStorage/src/InformationRegisters/ох_ПрисоединенныеФайлыВХранилище/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйДанныеФайлаХранилища() Экспорт
	
	ДанныеФайлаХранилища = Новый Структура;
	
	ДанныеФайлаХранилища.Вставить("Файл");
	ДанныеФайлаХранилища.Вставить("ВладелецФайла");
	ДанныеФайлаХранилища.Вставить("СервисныйАккаунт");
	ДанныеФайлаХранилища.Вставить("Бакет");
	ДанныеФайлаХранилища.Вставить("КлючОбъекта");
	ДанныеФайлаХранилища.Вставить("КонтрольнаяСумма");
	
	СсылкаФайлаХранилища = Новый Структура;
	СсылкаФайлаХранилища.Вставить("ДатаНачалаДействияСсылки");
	СсылкаФайлаХранилища.Вставить("ДатаОкончанияДействияСсылки");
	СсылкаФайлаХранилища.Вставить("Ссылка");
	
	ДанныеФайлаХранилища.Вставить("СсылкаФайлаХранилища", СсылкаФайлаХранилища);
	
	Возврат ДанныеФайлаХранилища;
	
КонецФункции

Процедура ЗаписатьФайлХранилища(ЗаписьФайлаХранилища) Экспорт
	
	ЗаписьФайла = СоздатьМенеджерЗаписи();
	
	ЗаписьФайла.Файл             = ЗаписьФайлаХранилища.Файл;
	ЗаписьФайла.ВладелецФайла    = ЗаписьФайлаХранилища.ВладелецФайла;
	ЗаписьФайла.СервисныйАккаунт = ЗаписьФайлаХранилища.СервисныйАккаунт;
	ЗаписьФайла.Бакет            = ЗаписьФайлаХранилища.Бакет;
	ЗаписьФайла.КлючОбъекта      = ЗаписьФайлаХранилища.КлючОбъекта;
	ЗаписьФайла.КонтрольнаяСумма = ЗаписьФайлаХранилища.КонтрольнаяСумма;
	ЗаписьФайла.ДатаИзменения    = ТекущаяДатаСеанса();
	
	ДанныеСсылки = ЗаписьФайлаХранилища.СсылкаФайлаХранилища;
	Если ЗначениеЗаполнено(ДанныеСсылки.Ссылка) Тогда
		ЗаписьФайла.ДатаНачалаДействияСсылки    = ДанныеСсылки.ДатаНачалаДействияСсылки;
		ЗаписьФайла.ДатаОкончанияДействияСсылки = ДанныеСсылки.ДатаОкончанияДействияСсылки;
		ЗаписьФайла.Ссылка = Новый ХранилищеЗначения(ДанныеСсылки.Ссылка, Новый СжатиеДанных(9));
	КонецЕсли;

	ЗаписьФайла.Записать();
	
КонецПроцедуры

Процедура УдалитьФайлХранилища(ЗаписьФайлаХранилища) Экспорт
	
	УдалениеФайла = СоздатьМенеджерЗаписи();
	
	УдалениеФайла.Файл             = ЗаписьФайлаХранилища.Файл;
	УдалениеФайла.ВладелецФайла    = ЗаписьФайлаХранилища.ВладелецФайла;
	УдалениеФайла.СервисныйАккаунт = ЗаписьФайлаХранилища.СервисныйАккаунт;
	УдалениеФайла.Бакет            = ЗаписьФайлаХранилища.Бакет;
	
	УдалениеФайла.Удалить();
	
КонецПроцедуры

Функция ИнформацияОФайлаХранилища(ОтборФайлов) Экспорт
	
	ИнформацияОФайла = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ох_ПрисоединенныеФайлыВХранилище.Файл КАК Файл,
		|	ох_ПрисоединенныеФайлыВХранилище.ВладелецФайла КАК ВладелецФайла,
		|	ох_ПрисоединенныеФайлыВХранилище.СервисныйАккаунт КАК СервисныйАккаунт,
		|	ох_ПрисоединенныеФайлыВХранилище.Бакет КАК Бакет,
		|	ох_ПрисоединенныеФайлыВХранилище.КлючОбъекта КАК КлючОбъекта,
		|	ох_ПрисоединенныеФайлыВХранилище.ДатаИзменения КАК ДатаИзменения,
		|	ох_ПрисоединенныеФайлыВХранилище.ДатаНачалаДействияСсылки КАК ДатаНачалаДействияСсылки,
		|	ох_ПрисоединенныеФайлыВХранилище.ДатаОкончанияДействияСсылки КАК ДатаОкончанияДействияСсылки,
		|	ох_ПрисоединенныеФайлыВХранилище.Ссылка КАК Ссылка,
		|	ох_ПрисоединенныеФайлыВХранилище.КонтрольнаяСумма КАК КонтрольнаяСумма
		|ИЗ
		|	РегистрСведений.ох_ПрисоединенныеФайлыВХранилище КАК ох_ПрисоединенныеФайлыВХранилище
		|ГДЕ
		|	ох_ПрисоединенныеФайлыВХранилище.Файл В(&Файлы)
		|	И ох_ПрисоединенныеФайлыВХранилище.СервисныйАккаунт = &СервисныйАккаунт
		|	И ох_ПрисоединенныеФайлыВХранилище.Бакет = &Бакет";
	
	Запрос.УстановитьПараметр("Файлы"           , ОтборФайлов.Файлы);
	Запрос.УстановитьПараметр("ВладелецФайла"   , ОтборФайлов.ВладелецФайла);
	Запрос.УстановитьПараметр("СервисныйАккаунт", ОтборФайлов.СервисныйАккаунт);
	Запрос.УстановитьПараметр("Бакет"           , ОтборФайлов.Бакет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("КлючОбъекта"                , Выборка.КлючОбъекта);
		ДанныеФайла.Вставить("ДатаИзменения"              , Выборка.ДатаИзменения);
		ДанныеФайла.Вставить("ДатаНачалаДействияСсылки"   , Выборка.ДатаНачалаДействияСсылки);
		ДанныеФайла.Вставить("ДатаОкончанияДействияСсылки", Выборка.ДатаОкончанияДействияСсылки);
		ДанныеФайла.Вставить("Ссылка"                     , Выборка.Ссылка.Получить());
		ДанныеФайла.Вставить("КонтрольнаяСумма"           , Выборка.КонтрольнаяСумма);
		
		ИнформацияОФайла.Вставить(Выборка.Файл, ДанныеФайла);
		
	КонецЦикла;
	
	Возврат ИнформацияОФайла;
	
КонецФункции

Процедура ОбновитьСсылкиФайлов() Экспорт
	
	ДатаОбновленияСсылок = КонецДня(ТекущаяДатаСеанса() + 86400);
	
	ПараметрыРаботыОбъектногоХранилища = ох_ОбъектноеХранилище.НовыйПараметрыРаботыСОбъектнымХранилищем();
	
	Пока Истина Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	ох_ПрисоединенныеФайлыВХранилище.Файл КАК Файл,
		|	ох_ПрисоединенныеФайлыВХранилище.ВладелецФайла КАК ВладелецФайла,
		|	ох_ПрисоединенныеФайлыВХранилище.СервисныйАккаунт КАК СервисныйАккаунт,
		|	ох_ПрисоединенныеФайлыВХранилище.Бакет КАК Бакет,
		|	ох_ПрисоединенныеФайлыВХранилище.КлючОбъекта КАК КлючОбъекта,
		|	ох_ПрисоединенныеФайлыВХранилище.ДатаИзменения КАК ДатаИзменения,
		|	ох_ПрисоединенныеФайлыВХранилище.ДатаНачалаДействияСсылки КАК ДатаНачалаДействияСсылки,
		|	ох_ПрисоединенныеФайлыВХранилище.ДатаОкончанияДействияСсылки КАК ДатаОкончанияДействияСсылки,
		|	ох_ПрисоединенныеФайлыВХранилище.Ссылка КАК Ссылка,
		|	ох_ПрисоединенныеФайлыВХранилище.КонтрольнаяСумма КАК КонтрольнаяСумма
		|ИЗ
		|	РегистрСведений.ох_ПрисоединенныеФайлыВХранилище КАК ох_ПрисоединенныеФайлыВХранилище
		|ГДЕ
		|	ох_ПрисоединенныеФайлыВХранилище.ДатаОкончанияДействияСсылки <= &ДатаОбновленияСсылок
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОкончанияДействияСсылки";
		
		Запрос.УстановитьПараметр("ДатаОбновленияСсылок", ДатаОбновленияСсылок);
		
		// BSLLS:CreateQueryInCycle-off Порционная обработка (батч-пагинатор) по std725: записи выходят из-под условия ГДЕ после обновления ссылок, цикл конечен.
		РезультатЗапроса = Запрос.Выполнить();
		// BSLLS:CreateQueryInCycle-on
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить();
		ЭлементБлокировки.Область        = Метаданные.РегистрыСведений.ох_ПрисоединенныеФайлыВХранилище.ПолноеИмя();
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Файл"            , "Файл");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ВладелецФайла"   , "ВладелецФайла");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СервисныйАккаунт", "СервисныйАккаунт");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Бакет"           , "Бакет");
		
		НачатьТранзакцию();
		Попытка
			
			БлокировкаДанных.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ПараметрыРаботыОбъектногоХранилища.СервисныйАккаунт = Выборка.СервисныйАккаунт;
				ПараметрыРаботыОбъектногоХранилища.Бакет            = Выборка.Бакет;
				
				ПараметрыПолученияСсылки = ох_ОбъектноеХранилище.НовыйПараметрыПолученияСсылки();
				ПараметрыПолученияСсылки.ДанныеФайла.Ссылка        = Выборка.Файл;
				ПараметрыПолученияСсылки.ДанныеФайла.ВладелецФайла = Выборка.ВладелецФайла;
				
				ДанныеСсылки = ох_ОбъектноеХранилище.ПолучитьСсылкуФайла(
					ПараметрыРаботыОбъектногоХранилища, ПараметрыПолученияСсылки);
				
				ЗаписьФайлаХранилища = НовыйДанныеФайлаХранилища();
				ЗаполнитьЗначенияСвойств(ЗаписьФайлаХранилища, Выборка);
				
				ЗаписьФайлаХранилища.СсылкаФайлаХранилища.ДатаНачалаДействияСсылки    = ДанныеСсылки.ДатаНачалаДействия;
				ЗаписьФайлаХранилища.СсылкаФайлаХранилища.ДатаОкончанияДействияСсылки = ДанныеСсылки.ДатаОкончанияДействия;
				ЗаписьФайлаХранилища.СсылкаФайлаХранилища.Ссылка                      = ДанныеСсылки.Ссылка;
				
				ЗаписатьФайлХранилища(ЗаписьФайлаХранилища);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

Процедура УдалитьФайлыПоСрокуХранения(КоличествоДнейХраненияФайлов) Экспорт
	
	ДатаУдаленияФайлов = НачалоДня(ТекущаяДатаСеанса() - 86400 * КоличествоДнейХраненияФайлов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ох_ПрисоединенныеФайлыВХранилище.Файл КАК Файл,
		|	ох_ПрисоединенныеФайлыВХранилище.ВладелецФайла КАК ВладелецФайла,
		|	ох_ПрисоединенныеФайлыВХранилище.СервисныйАккаунт КАК СервисныйАккаунт,
		|	ох_ПрисоединенныеФайлыВХранилище.Бакет КАК Бакет
		|ИЗ
		|	РегистрСведений.ох_ПрисоединенныеФайлыВХранилище КАК ох_ПрисоединенныеФайлыВХранилище
		|ГДЕ
		|	ох_ПрисоединенныеФайлыВХранилище.ДатаИзменения < &ДатаУдаленияФайлов";
	
	Запрос.УстановитьПараметр("ДатаУдаленияФайлов", ДатаУдаленияФайлов);
	
	ПараметрыОбъектногоХранилища = ох_ОбъектноеХранилище.НовыйПараметрыРаботыСОбъектнымХранилищем();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыОбъектногоХранилища, Выборка);
		ох_ОбъектноеХранилище.ЗарегистрироватьФайлДляУдаления(
			Выборка.Файл, ПараметрыОбъектногоХранилища, Выборка.ВладелецФайла);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
